<?php

use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $fam = array('Иванов', 'Васильев', 'Петров', 'Смирнов', 'Соколов', 'Попов', 'Алексеев',
            'Павлов', 'Егоров', 'Федоров', 'Волков', 'Лебедев', 'Яковлев', 'Андропов', 'Есенин', 'Абрамов', 'Авдеев',
            'Агафонов', 'Аксёнов', 'Александров', 'Анисимов', 'Белов', 'Белозёров', 'Белоусов', 'Беляев', 'Беляков',
            'Беспалов', 'Бирюков', 'Буров', 'Быков', 'Власов', 'Голубев', 'Гришин', 'Денисов', 'Дорофеев');
        $imya = array('Иван', 'Александр', 'Павел', 'Дмитрий', 'Николай', 'Алексей', 'Константин',
            'Егор', 'Федор', 'Василий', 'Антон', 'Сергей', 'Артем', 'Евгений', 'Георгий', 'Даниил', 'Леонид', 'Мартин', 'Олег', 'Петр'
        , 'Руслан', 'Семен', 'Вячеслав', 'Савелий', 'Станислав', 'Тарас', 'Тимофей', 'Федор', 'Яков', 'Денис', 'Павел',
            'Дмитрий', 'Никита', 'Максим', 'Алексей');
        $otch = array('Иванович', 'Петрович', 'Сидорович', 'Ильич', 'Павлович', 'Сергеевич', 'Анатольевич',
            'Александрович', 'Егорович', 'Николаевич', 'Владимирович', 'Олегович', 'Георгиевич', 'Евгениевич', 'Константинович', 'Данилович'
        , 'Олегович', 'Дмитриевич', 'Масимович', 'Алексеевич', 'Федорович', 'Явкоич', 'Савелиевич', 'Вячеславович', 'Семенович',
            'Русланович', 'Антонович', 'Тимофеевич', 'Василиевич', 'Тихонович', 'Григориевич', 'Леонидович', 'Аркадиевич', 'Борисович', 'Вадимович');
        $pos = array('Директор', 'Начальник', 'Бухгалтер', 'Рабочий', 'Уборщик');
        $n = 0;
        $m = 2;
        DB::table('employers')->delete();

        DB::statement('SET FOREIGN_KEY_CHECKS=0');
        DB::table('employers')->insert([
            'id' => 1,
            'fio' => 'Плитка Александр Юрьевич',
            'position' => 'Генеральный директор',
            'date' => '2008-12-12',
            'salary' => rand(10000, 100000),
            'chief' => 0
        ]);
        DB::statement('SET FOREIGN_KEY_CHECKS=1');


        for ($i = 0; $i < count($fam); $i++) {
            for ($j = 0; $j < count($imya); $j++) {
                for ($k = 0; $k < count($otch); $k++) {
                    if ($n == 5) // кол-во уровней иерархии
                        $n = 0;
                    if ($n == 0) {
                        DB::table('employers')->insert([
                            'id' => $m,
                            'fio' => $fam[$i].' '.$imya[$j].' '.$otch[$k],
                            'position' => $pos[$n],
                            'date' => date("Ymd", mktime(0, 0, 0, rand(1, 12), rand(1, 31), rand(2001, 2016))),
                            'salary' => rand(10000, 100000),
                            'chief' => 1
                        ]);
                    } else {
                        DB::table('employers')->insert([
                            'id' => $m,
                            'fio' => $fam[$i].' '.$imya[$j].' '.$otch[$k],
                            'position' => $pos[$n],
                            'date' => date("Ymd", mktime(0, 0, 0, rand(1, 12), rand(1, 31), rand(2001, 2016))),
                            'salary' => rand(10000, 100000),
                            'chief' => $m - 1
                        ]);
                    }
                    $n++;
                    $m++;
                }
            }
        }
    }
}
